<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="ALBL的个人博客" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="##&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x673A;&amp;#x5236;
JavaScript &amp;#x5177;&amp;#x6709;&amp;#x81EA;&amp;#x52A8;&amp;#x5783;&amp;#x573E;&amp;#x6536;&amp;#x96C6;&amp;#x673A;&amp;#x5236;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5C31;&amp;#x662F;&amp;#x8BF4;&amp;#xFF0C;&amp;#x6267;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="垃圾回收机制">
<meta property="og:url" content="http://yoursite.com/2016/09/27/预解释-作用域-this关键字-闭包/垃圾回收机制/index.html">
<meta property="og:site_name" content="章礼俊的个人博客">
<meta property="og:description" content="##&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x673A;&amp;#x5236;
JavaScript &amp;#x5177;&amp;#x6709;&amp;#x81EA;&amp;#x52A8;&amp;#x5783;&amp;#x573E;&amp;#x6536;&amp;#x96C6;&amp;#x673A;&amp;#x5236;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5C31;&amp;#x662F;&amp;#x8BF4;&amp;#xFF0C;&amp;#x6267;&amp;#">
<meta property="og:updated_time" content="2016-11-07T06:39:25.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="垃圾回收机制">
<meta name="twitter:description" content="##&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x673A;&amp;#x5236;
JavaScript &amp;#x5177;&amp;#x6709;&amp;#x81EA;&amp;#x52A8;&amp;#x5783;&amp;#x573E;&amp;#x6536;&amp;#x96C6;&amp;#x673A;&amp;#x5236;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5C31;&amp;#x662F;&amp;#x8BF4;&amp;#xFF0C;&amp;#x6267;&amp;#">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"right","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/09/27/预解释-作用域-this关键字-闭包/垃圾回收机制/"/>

  <title> 垃圾回收机制 | 章礼俊的个人博客 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?ff33d06371cbc1cc9b3821952ca6c795";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-right page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta custom-logo">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">章礼俊的个人博客</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">HTML5知识笔记</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                垃圾回收机制
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-27T16:34:46+08:00" content="2016-09-27">
              2016-09-27
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/27/预解释-作用域-this关键字-闭包/垃圾回收机制/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count disqus-comment-count" data-disqus-identifier="2016/09/27/预解释-作用域-this关键字-闭包/垃圾回收机制/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>##&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;</p>
<p>JavaScript &#x5177;&#x6709;&#x81EA;&#x52A8;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4F1A;&#x8D1F;&#x8D23;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF1B;</p>
<p>&#x5728;&#x7F16;&#x5199; JavaScript &#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x7528;&#x518D;&#x5173;&#x5FC3;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x9700;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#x4EE5;&#x53CA;&#x65E0;&#x7528;&#x5185;&#x5B58;&#x7684;&#x56DE;&#x6536;&#x5B8C;&#x5168;&#x5B9E;&#x73B0;&#x4E86;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x3002;&#x8FD9;&#x79CD;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x7684;&#x539F;&#x7406;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x627E;&#x51FA;&#x90A3;&#x4E9B;&#x4E0D;&#x518D;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x91CA;&#x653E;&#x5176;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4F1A;&#x6309;&#x7167;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF08;&#x6216;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x4E2D;&#x9884;&#x5B9A;&#x7684;&#x6536;&#x96C6;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x5468;&#x671F;&#x6027;&#x5730;&#x6267;&#x884C;&#x8FD9;&#x4E00;&#x64CD;&#x4F5C;&#x3002;</p>
<ul>
<li>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x53EA;&#x5728;&#x51FD;&#x6570;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B58;&#x5728;&#x3002;&#x800C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x4E3A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x6808;&#xFF08;&#x6216;&#x5806;&#xFF09;&#x5185;&#x5B58;&#x4E0A;&#x5206;&#x914D;&#x76F8;&#x5E94;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B58;&#x50A8;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x3002;&#x7136;&#x540E;&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x4F7F;<br>&#x7528;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#xFF0C;&#x76F4;&#x81F3;&#x51FD;&#x6570;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x3002;</li>
<li>&#x6B64;&#x65F6;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5C31;&#x6CA1;&#x6709;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x91CA;&#x653E;&#x5B83;&#x4EEC;&#x7684;&#x5185;&#x5B58;&#x4EE5;&#x4F9B;&#x5C06;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x5224;&#x65AD;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x8FD8;&#x6709;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#xFF1B;</li>
<li>&#x4F46;&#x5E76;&#x975E;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x8FD9;&#x4E48;&#x5BB9;&#x6613;&#x5C31;&#x80FD;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#x3002;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5FC5;&#x987B;&#x8DDF;&#x8E2A;&#x54EA;&#x4E2A;&#x53D8;&#x91CF;&#x6709;&#x7528;&#x54EA;&#x4E2A;&#x53D8;&#x91CF;&#x6CA1;&#x7528;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x518D;&#x6709;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x6253;&#x4E0A;&#x6807;&#x8BB0;&#xFF0C;&#x4EE5;&#x5907;&#x5C06;&#x6765;&#x6536;&#x56DE;&#x5176;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x65E0;&#x7528;&#x53D8;&#x91CF;&#x7684;&#x7B56;&#x7565;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x5B9E;&#x73B0;&#x800C;&#x5F02;&#xFF0C;&#x4F46;&#x5177;&#x4F53;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5219;&#x901A;&#x5E38;&#x6709;&#x4E24;&#x4E2A;&#x7B56;&#x7565;;<strong>&#x6807;&#x8BB0;&#x6E05;&#x9664;</strong>&#x548C;<strong>&#x5F15;&#x7528;&#x8BA1;&#x6570;</strong>&#x3002;</li>
</ul>
<hr>
<ul>
<li><strong>&#x6807;&#x8BB0;&#x6E05;&#x9664;</strong>&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;</li>
<li><strong>&#x5F15;&#x7528;&#x8BA1;&#x6570;</strong>&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;</li>
<li><strong>&#x6027;&#x80FD;&#x95EE;&#x9898;</strong></li>
<li><strong>&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x600E;&#x6837;&#x7BA1;&#x7406;&#x5185;&#x5B58;</strong>&#xFF08;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#xFF09;</li>
<li><strong>&#x603B;&#x7ED3;</strong></li>
</ul>
<h1 id="&#x6807;&#x8BB0;&#x6E05;&#x9664;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;"><a href="#&#x6807;&#x8BB0;&#x6E05;&#x9664;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;" class="headerlink" title="&#x6807;&#x8BB0;&#x6E05;&#x9664;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;"></a>&#x6807;&#x8BB0;&#x6E05;&#x9664;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;</h1><p>JavaScript &#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65B9;&#x5F0F;&#x662F;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x3002;</p>
<ul>
<li>&#x5F53;&#x53D8;&#x91CF;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF09;&#x65F6;&#xFF0C;&#x5C31;&#x5C06;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x6807;&#x8BB0;&#x4E3A;&#x201C;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#x201D;&#x3002;&#x4ECE;&#x903B;&#x8F91;&#x4E0A;&#x8BB2;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x91CA;&#x653E;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x91CF;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x8981;&#x6267;&#x884C;&#x6D41;&#x8FDB;&#x5165;&#x76F8;&#x5E94;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x5230;&#x5B83;&#x4EEC;&#x3002;</li>
<li>&#x800C;&#x5F53;&#x53D8;&#x91CF;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x65F6;&#xFF0C;&#x5219;&#x5C06;&#x5176;&#x6807;&#x8BB0;&#x4E3A;&#x201C;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x201D;&#x3002;</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x6765;&#x6807;&#x8BB0;&#x53D8;&#x91CF;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7FFB;&#x8F6C;&#x67D0;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x4F4D;&#x6765;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4F55;&#x65F6;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x201C;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#x7684;&#x201D;&#x53D8;&#x91CF;&#x5217;&#x8868;&#x53CA;&#x4E00;&#x4E2A;&#x201C;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x7684;&#x201D;&#x53D8;&#x91CF;&#x5217;&#x8868;&#x6765;&#x8DDF;&#x8E2A;&#x54EA;&#x4E2A;&#x53D8;&#x91CF;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#x3002;&#x8BF4;&#x5230;&#x5E95;&#xFF0C;&#x5982;&#x4F55;&#x6807;&#x8BB0;&#x53D8;&#x91CF;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x91C7;&#x53D6;&#x4EC0;&#x4E48;&#x7B56;&#x7565;&#x3002;</p>
<ul>
<li>1&#x3001;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x7ED9;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x90FD;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x6807;&#x8BB0;&#x65B9;&#x5F0F;&#xFF09;&#x3002;</li>
<li>2&#x3001;&#x5B83;&#x4F1A;&#x53BB;&#x6389;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x4EE5;&#x53CA;&#x88AB;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x6807;&#x8BB0;&#x3002;</li>
<li>3&#x3001;&#x5728;&#x6B64;&#x4E4B;&#x540E;&#x518D;&#x88AB;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#x7684;&#x53D8;&#x91CF;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x51C6;&#x5907;&#x5220;&#x9664;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5230;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x4E86;&#x3002;</li>
<li>4&#x3001;&#x6700;&#x540E;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5B8C;&#x6210;&#x5185;&#x5B58;&#x6E05;&#x9664;&#x5DE5;&#x4F5C;&#xFF0C;&#x9500;&#x6BC1;&#x90A3;&#x4E9B;&#x5E26;&#x6807;&#x8BB0;&#x7684;&#x503C;&#x5E76;&#x56DE;&#x6536;&#x5B83;&#x4EEC;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;</li>
</ul>
<h1 id="&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;"><a href="#&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;" class="headerlink" title="&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;"></a>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF09;</h1><p>&#x53E6;&#x4E00;&#x79CD;&#x4E0D;&#x592A;&#x5E38;&#x89C1;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B56;&#x7565;&#x53EB;&#x505A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;</p>
<p>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7684;&#x542B;&#x4E49;&#x662F;&#x8DDF;&#x8E2A;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x503C;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x6B21;&#x6570;&#x3002;</p>
<ul>
<li>&#x5F53;&#x58F0;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5E76;&#x5C06;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x8D4B;&#x7ED9;&#x8BE5;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x5F15;&#x7528;&#x6570;&#x636E;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x5C31;&#x662F; 1&#x3002;</li>
<li>&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x503C;&#x53C8;&#x88AB;&#x8D4B;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5219;&#x8BE5;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x52A0; 1&#x3002;</li>
<li>&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x5305;&#x542B;&#x5BF9;&#x8FD9;&#x4E2A;&#x503C;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x53C8;&#x53D6;&#x5F97;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x51CF; 1&#x3002;</li>
<li>&#x5F53;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x53D8;&#x6210; 0 &#x65F6;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x518D;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x503C;&#x4E86;&#xFF0C;&#x56E0;&#x800C;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x56DE;&#x6536;&#x56DE;&#x6765;&#x3002;</li>
<li>&#x8FD9;&#x6837;&#xFF0C;&#x5F53;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E0B;&#x6B21;&#x518D;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x91CA;&#x653E;&#x90A3;&#x4E9B;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x4E3A;&#x96F6;&#x7684;&#x503C;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6709;&#x4E00;&#x4E2A;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF1B;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#xFF1B;</p>
<pre><code>function problem(){
    var objectA = new Object();
    var objectB = new Object();
    objectA.someOtherObject = objectB;
    objectB.anotherObject = objectA;
}
</code></pre><ul>
<li>objectA &#x548C; objectB &#x901A;&#x8FC7;&#x5404;&#x81EA;&#x7684;&#x5C5E;&#x6027;&#x76F8;&#x4E92;&#x5F15;&#x7528;&#xFF1B;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x90FD;&#x662F; 2&#x3002;&#x5728;&#x91C7;&#x7528;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B56;&#x7565;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x51FD;&#x6570;&#x6267;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x79BB;&#x5F00;&#x4E86;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x79CD;&#x76F8;&#x4E92;&#x5F15;&#x7528;&#x4E0D;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x4F46;&#x5728;&#x91C7;&#x7528;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7B56;&#x7565;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x5F53;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C; objectA &#x548C; objectB &#x8FD8;&#x5C06;&#x7EE7;&#x7EED;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x662F; 0&#x3002;</li>
<li>&#x5047;&#x5982;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x88AB;&#x91CD;&#x590D;&#x591A;&#x6B21;&#x8C03;&#x7528;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x5F97;&#x4E0D;&#x5230;&#x56DE;&#x6536;&#x3002;</li>
</ul>
<h1 id="&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF1B;"><a href="#&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF1B;" class="headerlink" title="&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF1B;"></a>&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF1B;</h1><p>&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x662F;&#x5468;&#x671F;&#x6027;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x4E3A;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x5F88;&#x53EF;&#x89C2;&#xFF0C;&#x90A3;&#x4E48;&#x56DE;&#x6536;&#x5DE5;&#x4F5C;&#x91CF;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x786E;&#x5B9A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8BF4;&#x5230;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x4E00;&#x6B21;;</p>
<p>&#x4E0D;&#x7981;&#x8BA9;&#x4EBA;&#x8054;&#x60F3;&#x5230; IE &#x56E0;&#x6B64;&#x800C;&#x58F0;&#x540D;&#x72FC;&#x85C9;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;IE &#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x662F;&#x6839;&#x636E;&#x5185;&#x5B58;&#x5206;&#x914D;&#x91CF;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#x8BF4;&#x5C31;&#x662F; 256 &#x4E2A;&#x53D8;&#x91CF;&#x3001;4096 &#x4E2A;&#x5BF9;&#x8C61;&#xFF08;&#x6216;&#x6570;&#x7EC4;&#xFF09;&#x5B57;&#x9762;&#x91CF;&#x548C;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#xFF08;slot&#xFF09;&#x6216;&#x8005; 64KB &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8FBE;&#x5230;&#x4E0A;&#x8FF0;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4E34;&#x754C;&#x503C;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5C31;&#x4F1A;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x4E2D;&#x5305;&#x542B;&#x90A3;&#x4E48;&#x591A;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x811A;&#x672C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5176;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x4E00;&#x76F4;&#x4FDD;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x800C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x9891;&#x7E41;&#x5730;&#x8FD0;&#x884C;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x7531;&#x6B64;&#x5F15;&#x53D1;&#x7684;&#x4E25;&#x91CD;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x4FC3;&#x4F7F; IE7 &#x91CD;&#x5199;&#x4E86;&#x5176;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4F8B;&#x7A0B;&#x3002;</p>
<p>&#x968F;&#x7740; IE7 &#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x5176; JavaScript &#x5F15;&#x64CE;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4F8B;&#x7A0B;&#x6539;&#x53D8;&#x4E86;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF1A;<strong>&#x89E6;&#x53D1;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x3001;&#x5B57;&#x9762;&#x91CF;&#x548C;&#xFF08;&#x6216;&#xFF09;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x7684;&#x4E34;&#x754C;&#x503C;&#x88AB;&#x8C03;&#x6574;&#x4E3A;&#x52A8;&#x6001;&#x4FEE;&#x6B63;</strong>&#x3002;IE7 &#x4E2D;&#x7684;&#x5404;&#x9879;&#x4E34;&#x754C;&#x503C;&#x5728;&#x521D;&#x59CB;&#x65F6;&#x4E0E; IE6 &#x76F8;&#x7B49;&#x3002;</p>
<ul>
<li>&#x5982;&#x679C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4F8B;&#x7A0B;&#x56DE;&#x6536;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x91CF;&#x4F4E;&#x4E8E; 15%&#xFF0C;&#x5219;&#x53D8;&#x91CF;&#x3001;&#x5B57;&#x9762;&#x91CF;&#x548C;&#xFF08;&#x6216;&#xFF09;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x7684;&#x4E34;&#x754C;&#x503C;&#x5C31;&#x4F1A;&#x52A0;&#x500D;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F8B;&#x7A0B;&#x56DE;&#x6536;&#x4E86; 85%&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x91CF;&#xFF0C;&#x5219;&#x5C06;&#x5404;&#x79CD;&#x4E34;&#x754C;&#x503C;&#x91CD;&#x7F6E;&#x56DE;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</li>
</ul>
<blockquote>
<p>&#x8FD9;&#x4E00;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x6781;&#x5927;&#x5730;&#x63D0;&#x5347;&#x4E86; IE&#x5728;&#x8FD0;&#x884C;&#x5305;&#x542B;&#x5927;&#x91CF; JavaScript &#x7684;&#x9875;&#x9762;&#x65F6;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
</blockquote>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x53EF;&#x4EE5;&#x89E6;&#x53D1;&#x5783;&#x573E;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x5EFA;&#x8BAE;&#x8BFB;&#x8005;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x5728;IE &#x4E2D;&#xFF0C;&#x8C03;&#x7528; window.CollectGarbage() &#x65B9;&#x6CD5;&#x4F1A;&#x7ACB;&#x5373;&#x6267;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3002;&#x5728; Opera 7 &#x53CA;&#x66F4;&#x9AD8;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x8C03;&#x7528; window.opera.collect() &#x4E5F;&#x4F1A;&#x542F;&#x52A8;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4F8B;&#x7A0B;&#x3002;</p>
<h1 id="&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x600E;&#x6837;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#xFF08;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;-&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x601D;&#x60F3;&#xFF09;"><a href="#&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x600E;&#x6837;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#xFF08;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;-&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x601D;&#x60F3;&#xFF09;" class="headerlink" title="&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x600E;&#x6837;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#xFF08;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;,&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x601D;&#x60F3;&#xFF09;"></a>&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x600E;&#x6837;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#xFF08;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;,&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x601D;&#x60F3;&#xFF09;</h1><p>&#x4F7F;&#x7528;&#x5177;&#x5907;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x7684;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x822C;&#x4E0D;&#x5FC5;&#x64CD;&#x5FC3;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#xFF0C;JavaScript&#x5728;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x53CA;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65F6;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x5206;&#x914D;&#x7ED9; Web&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x901A;&#x5E38;&#x8981;&#x6BD4;&#x5206;&#x914D;&#x7ED9;&#x684C;&#x9762;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5C11;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x76EE;&#x7684;&#x4E3B;&#x8981;&#x662F;&#x51FA;&#x4E8E;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x9632;&#x6B62;&#x8FD0;&#x884C; JavaScript &#x7684;&#x7F51;&#x9875;&#x8017;&#x5C3D;&#x5168;&#x90E8;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x800C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x3002;&#x5185;&#x5B58;&#x9650;&#x5236;&#x95EE;&#x9898;&#x4E0D;&#x4EC5;&#x4F1A;&#x5F71;&#x54CD;&#x7ED9;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x4F1A;&#x5F71;&#x54CD;&#x8C03;&#x7528;&#x6808;&#x4EE5;&#x53CA;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x6267;&#x884C;&#x7684;&#x8BED;&#x53E5;&#x6570;&#x91CF;&#x3002;</p>
<p><strong> &#x56E0;&#x6B64;&#xFF0C;&#x786E;&#x4FDD;&#x5360;&#x7528;&#x6700;&#x5C11;&#x7684;&#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x8BA9;&#x9875;&#x9762;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x800C;&#x4F18;&#x5316;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x6267;&#x884C;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x53EA;&#x4FDD;&#x5B58;&#x5FC5;&#x8981;&#x7684;&#x6570;&#x636E;&#x3002;&#x4E00;&#x65E6;&#x6570;&#x636E;&#x4E0D;&#x518D;&#x6709;&#x7528;&#xFF0C;&#x6700;&#x597D;&#x901A;&#x8FC7;&#x5C06;&#x5176;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A; null &#x6765;&#x91CA;&#x653E;&#x5176;&#x5F15;&#x7528;&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x505A;&#x6CD5;&#x53EB;&#x505A;&#x89E3;&#x9664;&#x5F15;&#x7528;&#xFF08;dereferencing&#xFF09;</strong>&#x3002;</p>
<p><strong> &#x8FD9;&#x4E00;&#x505A;&#x6CD5;&#x9002;&#x7528;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4F1A;&#x5728;&#x5B83;&#x4EEC;&#x79BB;&#x5F00;&#x6267;&#x884C;&#x73AF;&#x5883;&#x65F6;&#x81EA;&#x52A8;&#x88AB;&#x89E3;&#x9664;&#x5F15;&#x7528;&#xFF1B;</strong></p>
<pre><code>function createPerson(name){
    var localPerson = new Object();
    localPerson.name = name;
    return localPerson;
}
var globalPerson = createPerson(&quot;Nicholas&quot;);
// &#x624B;&#x5DE5;&#x89E3;&#x9664; globalPerson &#x7684;&#x5F15;&#x7528;
globalPerson = null;
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x53D8;&#x91CF; globalPerson &#x53D6;&#x5F97;&#x4E86; createPerson() &#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x3002;&#x5728; createPerson()&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5E76;&#x5C06;&#x5176;&#x8D4B;&#x7ED9;&#x5C40;&#x90E8;&#x53D8;&#x91CF; localPerson &#xFF0C;&#x7136;&#x540E;&#x53C8;&#x4E3A;&#x8BE5;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;name &#x7684;&#x5C5E;&#x6027;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5F53;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x65F6;&#xFF0C; localPerson &#x4EE5;&#x51FD;&#x6570;&#x503C;&#x7684;&#x5F62;&#x5F0F;&#x8FD4;&#x56DE;&#x5E76;&#x8D4B;&#x7ED9;&#x5168;&#x5C40;&#x53D8;&#x91CF;globalPerson &#x3002;</p>
<p>&#x7531;&#x4E8E; localPerson &#x5728; createPerson() &#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#x5C31;&#x79BB;&#x5F00;&#x4E86;&#x5176;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x9700;&#x6211;&#x4EEC;&#x663E;&#x5F0F;&#x5730;&#x53BB;&#x4E3A;&#x5B83;&#x89E3;&#x9664;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5168;&#x5C40;&#x53D8;&#x91CF; globalPerson &#x800C;&#x8A00;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x624B;&#x5DE5;&#x4E3A;&#x5B83;&#x89E3;&#x9664;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x4E5F;&#x6B63;&#x662F;&#x4E0A;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x6700;&#x540E;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x89E3;&#x9664;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x5F15;&#x7528;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x81EA;&#x52A8;&#x56DE;&#x6536;&#x8BE5;&#x503C;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;&#x89E3;&#x9664;&#x5F15;&#x7528;&#x7684;&#x771F;&#x6B63;&#x4F5C;&#x7528;&#x662F;&#x8BA9;&#x503C;&#x8131;&#x79BB;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x4EE5;&#x4FBF;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E0B;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#x5C06;&#x5176;&#x56DE;&#x6536;&#x3002;</p>
</blockquote>
<h1 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h1><p>JavaScript &#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF1A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x3002;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x6E90;&#x81EA;&#x4EE5;&#x4E0B; 5&#x79CD;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A; Undefined &#x3001; Null &#x3001; Boolean &#x3001; Number &#x548C; String &#x3002;</p>
<p>&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5360;&#x636E;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;&#x4FDD;&#x5B58;&#x5728;&#x6808;&#x5185;&#x5B58;&#x4E2D;&#xFF1B;</li>
<li>&#x4ECE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x590D;&#x5236;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x4F1A;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#xFF1B;</li>
<li>&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#xFF1B;</li>
<li>&#x5305;&#x542B;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x7684;&#x53D8;&#x91CF;&#x5B9E;&#x9645;&#x4E0A;&#x5305;&#x542B;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x6307;&#x9488;&#xFF1B;</li>
<li>&#x4ECE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x590D;&#x5236;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x590D;&#x5236;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x6B64;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x6700;&#x7EC8;&#x90FD;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF1B;</li>
<li><p>&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x503C;&#x662F;&#x54EA;&#x79CD;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; typeof &#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x800C;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x503C;&#x662F;&#x54EA;&#x79CD;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;instanceof &#x64CD;&#x4F5C;&#x7B26;&#xFF1B;&#x5982;&#x679C;&#x8981;&#x7EDD;&#x5BF9;&#x51C6;&#x786E;&#x7684;&#x5224;&#x65AD;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;</p>
<p>  var testStr = &#x2018;cccccccc&#x2019;;<br>  var testAry = [2,3,4,5];<br>  var testObj = {</p>
<pre><code>name:&quot;zhu&quot;,
age:26,
gender:&quot;man&quot;
</code></pre><p>  };</p>
<p>  console.log({}.toString.call(testStr));//[object String]<br>  console.log({}.toString.call(testAry));//[object Array]<br>  console.log({}.toString.call(testObj));//[object Object]</p>
</li>
</ul>
<p>&#x6240;&#x6709;&#x53D8;&#x91CF;&#xFF08;&#x5305;&#x62EC;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF09;&#x90FD;&#x5B58;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x4F5C;&#x7528;&#x57DF;&#xFF09;&#x5F53;&#x4E2D;&#xFF0C;<strong>&#x8FD9;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#x51B3;&#x5B9A;&#x4E86;&#x53D8;&#x91CF;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x4EE5;&#x53CA;&#x54EA;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x7684;&#x53D8;&#x91CF;</strong>&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x5173;&#x4E8E;&#x6267;&#x884C;&#x73AF;&#x5883;&#x7684;&#x51E0;&#x70B9;&#x603B;&#x7ED3;&#xFF1A;</p>
<ul>
<li>&#x6267;&#x884C;&#x73AF;&#x5883;&#x6709;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x5168;&#x5C40;&#x73AF;&#x5883;&#xFF09;&#x548C;&#x51FD;&#x6570;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E4B;&#x5206;&#xFF1B;</li>
<li>&#x6BCF;&#x6B21;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x641C;&#x7D22;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF1B;</li>
<li>&#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x4E0D;&#x4EC5;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x51FD;&#x6570;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x5176;&#x5305;&#x542B;&#xFF08;&#x7236;&#xFF09;&#x73AF;&#x5883;&#xFF0C;&#x4E43;&#x81F3;&#x5168;&#x5C40;&#x73AF;&#x5883;&#xFF1B;</li>
<li>&#x5168;&#x5C40;&#x73AF;&#x5883;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x5728;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#xFF1B;</li>
<li>&#x53D8;&#x91CF;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#x6709;&#x52A9;&#x4E8E;&#x786E;&#x5B9A;&#x5E94;&#x8BE5;&#x4F55;&#x65F6;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x3002;</li>
</ul>
<p>JavaScript &#x662F;&#x4E00;&#x95E8;&#x5177;&#x6709;&#x81EA;&#x52A8;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5FC5;&#x5173;&#x5FC3;&#x5185;&#x5B58;&#x5206;&#x914D;&#x548C;&#x56DE;&#x6536;&#x95EE;&#x9898;&#x3002;&#x53EF;&#x4EE5;&#x5BF9; JavaScript &#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4F8B;&#x7A0B;&#x4F5C;&#x5982;&#x4E0B;&#x603B;&#x7ED3;&#x3002;</p>
<ul>
<li>&#x79BB;&#x5F00;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x503C;&#x5C06;&#x88AB;&#x81EA;&#x52A8;&#x6807;&#x8BB0;&#x4E3A;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x671F;&#x95F4;&#x88AB;&#x5220;&#x9664;&#x3002;</li>
<li>&#x201C;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x201D;&#x662F;&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x7ED9;&#x5F53;&#x524D;&#x4E0D;&#x4F7F;&#x7528;&#x7684;&#x503C;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x56DE;&#x6536;&#x5176;&#x5185;&#x5B58;&#x3002;</li>
<li>&#x53E6;&#x4E00;&#x79CD;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x662F;&#x201C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x201D;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x8DDF;&#x8E2A;&#x8BB0;&#x5F55;&#x6240;&#x6709;&#x503C;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x6B21;&#x6570;&#x3002;JavaScript&#x5F15;&#x64CE;&#x76EE;&#x524D;&#x90FD;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#xFF1B;&#x4F46;&#x5728; IE &#x4E2D;&#x8BBF;&#x95EE;&#x975E;&#x539F;&#x751F; JavaScript &#x5BF9;&#x8C61;&#xFF08;&#x5982; DOM &#x5143;&#x7D20;&#xFF09;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x5F53;&#x4EE3;&#x7801;&#x4E2D;&#x5B58;&#x5728;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x73B0;&#x8C61;&#x65F6;&#xFF0C;&#x201C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x201D;&#x7B97;&#x6CD5;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x89E3;&#x9664;&#x53D8;&#x91CF;&#x7684;&#x5F15;&#x7528;&#x4E0D;&#x4EC5;&#x6709;&#x52A9;&#x4E8E;&#x6D88;&#x9664;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x73B0;&#x8C61;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4E5F;&#x6709;&#x597D;&#x5904;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6709;&#x6548;&#x5730;&#x56DE;&#x6536;&#x5185;&#x5B58;&#xFF0C;&#x5E94;&#x8BE5;&#x53CA;&#x65F6;&#x89E3;&#x9664;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x3001;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x4EE5;&#x53CA;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x7684;&#x5F15;&#x7528;&#x3002;</li>
</ul>

      
    </div>

    <div>
      
        
<div id="wechat_subscriber" style="display: block； padding: 10px 0; margin: 20px auto; width: 100%; text-align: center">
    <img id="wechat_subscriber_qcode" src="/uploads/wechat-qcode.jpg" alt="ALBL wechat" style="width: 200px; max-width: 100%;"/>
    <div>扫一扫上面的微信公众号，订阅我的博客！</div>
</div>

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/15/JS高级技巧/高级定时器/" rel="next" title="定时器">
                <i class="fa fa-chevron-left"></i> 定时器
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div id="disqus_thread">
        <noscript>
          Please enable JavaScript to view the
          <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a>
        </noscript>
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="http://www.ld12.com/upimg358/allimg/c140918/14109CRX22F-H018.jpg"
               alt="ALBL" />
          <p class="site-author-name" itemprop="name">ALBL</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">42</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#标记清除（浏览器实现）"><span class="nav-number">1.</span> <span class="nav-text">标记清除（浏览器实现）</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#引用计数（浏览器实现）"><span class="nav-number">2.</span> <span class="nav-text">引用计数（浏览器实现）</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#性能问题；"><span class="nav-number">3.</span> <span class="nav-text">性能问题；</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#开发过程中怎样管理内存（代码实现-比较重要的思想）"><span class="nav-number">4.</span> <span class="nav-text">开发过程中怎样管理内存（代码实现,比较重要的思想）</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#总结"><span class="nav-number">5.</span> <span class="nav-text">总结</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">ALBL</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  

    <script type="text/javascript">
      var disqus_shortname = 'your-disqus-shortname';
      var disqus_identifier = '2016/09/27/预解释-作用域-this关键字-闭包/垃圾回收机制/';
      var disqus_title = "垃圾回收机制";
      var disqus_url = 'http://yoursite.com/2016/09/27/预解释-作用域-this关键字-闭包/垃圾回收机制/';

      function run_disqus_script(disqus_script){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/' + disqus_script;
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
      }

      run_disqus_script('count.js');
      
        run_disqus_script('embed.js');
      
    </script>
  




  
  
  

  

  

</body>
</html>
